# EXERCISES I:

In [1]:
import pandas as pd
import numpy as np
from env import host, user, password
from pydataset import data


url = f'mysql+pymysql://{user}:{password}@{host}/employees'

In [ ]:
pd.read_sql('SELECT * FROM employees LIMIT 5 OFFSET 50', url)

#### #1 Create a function named get_db_url. It should accept a username, hostname, password, and database name and return a url connection string formatted like in the example at the start of this lesson.

In [2]:
def get_db_url(user, password, host, db_name):
    return f'mysql+pymysql://{user}:{password}@{host}/{db_name}'
get_db_url(user,password,host, 'Mammals')
Mammals_url = get_db_url(user,password,host, 'Mammals')

In [3]:
def get_db_url(user, password, host, db_name):
    return f'mysql+pymysql://{user}:{password}@{host}/{db_name}'
url = get_db_url(user,password,host, 'employees')

#### #2 Use your function to obtain a connection to the employees database.

In [4]:
get_db_url(user,password,host, 'employees')
emp_url = get_db_url(user,password,host, 'employees')

#### #3 Once you have successfully run a query:

#### #3.a Intentionally make a typo in the database url. What kind of error message do you see?

In [5]:
def get_db_url(user, password, host, db_name):
    return f'mysql+pymysql://{user}:{password}@{host}/{db_name}'
url = get_db_url(user,pasword,host, 'employees')

NameError: name 'pasword' is not defined

#### #3.b. Intentionally make an error in your SQL query. What does the error message look like?

In [ ]:
def get_db_url(user, password, host, db_name):
    return f'mysql+pymysql://{user}:{password}@{host}/{db_name}'
url = get_db_url(user,password,host, 'emplyees')

#### #4 Read the employees and titles tables into two separate DataFrames.

In [6]:
employees_df = pd.read_sql('SELECT * FROM employees LIMIT 5', url)
employees_df

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [7]:
titles_df = pd.read_sql('SELECT * FROM titles LIMIT 5', url)
titles_df

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01

In [11]:
employees_df = pd.read_sql('SELECT * FROM employees', url)
titles_df = pd.read_sql('SELECT * FROM titles', url)

#### #5 How many rows and columns do you have in each DataFrame? Is that what you expected?

In [9]:
employees_df.shape

(300024, 6)

In [10]:
titles_df.shape

(443308, 4)

#### #6 Display the summary statistics for each DataFrame

In [12]:
employees_df.describe()

              emp_no
count  300024.000000
mean   253321.763392
std    161828.235540
min     10001.000000
25%     85006.750000
50%    249987.500000
75%    424993.250000
max    499999.000000

In [13]:
employees_df.describe(include = 'all')

               emp_no  birth_date first_name last_name  gender   hire_date
count   300024.000000      300024     300024    300024  300024      300024
unique            NaN        4750       1275      1637       2        5434
top               NaN  1952-03-08     Shahab      Baba       M  1985-06-20
freq              NaN          95        295       226  179973         132
mean    253321.763392         NaN        NaN       NaN     NaN         NaN
std     161828.235540         NaN        NaN       NaN     NaN         NaN
min      10001.000000         NaN        NaN       NaN     NaN         NaN
25%      85006.750000         NaN        NaN       NaN     NaN         NaN
50%     249987.500000         NaN        NaN       NaN     NaN         NaN
75%     424993.250000         NaN        NaN       NaN     NaN         NaN
max     499999.000000         NaN        NaN       NaN     NaN         NaN

In [14]:
#this includes the desciption of only the int columns
employees_df.describe(exclude = np.number)

        birth_date first_name last_name  gender   hire_date
count       300024     300024    300024  300024      300024
unique        4750       1275      1637       2        5434
top     1952-03-08     Shahab      Baba       M  1985-06-20
freq            95        295       226  179973         132

#### #7 How many unique titles are in the titles DataFrame?

In [15]:
titles_df['title'].unique()
#this shows WHAT the unique titles are

array(['Senior Engineer', 'Staff', 'Engineer', 'Senior Staff',
       'Assistant Engineer', 'Technique Leader', 'Manager'], dtype=object)

In [16]:
len(titles_df['title'].unique())
#this shows HOW MANY unique titles there are

7

#### #8 What is the oldest date in the to_date column?

In [17]:
#this is one way
titles_df.to_date.sort_values().head(1)

16064    1985-03-01
Name: to_date, dtype: object

In [18]:
#another way
titles_df.to_date.min()

datetime.date(1985, 3, 1)

In [19]:
#another way
min(titles_df['to_date'])

datetime.date(1985, 3, 1)

#### #9 What is the most recent date in the to_date column?

In [20]:
max(titles_df['to_date'])

datetime.date(9999, 1, 1)

# EXERCISES II:

#### #1 Copy the users and roles DataFrames from the examples above.

In [21]:
users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
users

   id   name  role_id
0   1    bob      1.0
1   2    joe      2.0
2   3  sally      3.0
3   4   adam      3.0
4   5   jane      NaN
5   6   mike      NaN

In [22]:
roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})
roles

   id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter

#### #2 What is the result of using a right join on the DataFrames?

In [23]:
(users.merge(roles, 
            left_on='role_id', 
            right_on='id', 
            how='right')    
)

   id_x name_x  role_id  id_y     name_y
0   1.0    bob      1.0     1      admin
1   2.0    joe      2.0     2     author
2   3.0  sally      3.0     3   reviewer
3   4.0   adam      3.0     3   reviewer
4   NaN    NaN      NaN     4  commenter

In [24]:
#just out of curiosity- left join
(users.merge(roles, 
            left_on='role_id', 
            right_on='id', 
            how='left')    
)

   id_x name_x  role_id  id_y    name_y
0     1    bob      1.0   1.0     admin
1     2    joe      2.0   2.0    author
2     3  sally      3.0   3.0  reviewer
3     4   adam      3.0   3.0  reviewer
4     5   jane      NaN   NaN       NaN
5     6   mike      NaN   NaN       NaN

#### #3 What is the result of using an outer join on the DataFrames?

In [25]:
(users.merge(roles, 
            left_on='role_id', 
            right_on='id', 
            how='outer')
    .rename(columns={'id_x': 'id', 
                     'name_x': 'employee',
                     'id_y': 'role_id',
                     'name_y': 'role'}
            )
)
#cleaned up with renamed columns

    id employee  role_id  role_id       role
0  1.0      bob      1.0      1.0      admin
1  2.0      joe      2.0      2.0     author
2  3.0    sally      3.0      3.0   reviewer
3  4.0     adam      3.0      3.0   reviewer
4  5.0     jane      NaN      NaN        NaN
5  6.0     mike      NaN      NaN        NaN
6  NaN      NaN      NaN      4.0  commenter

#### #4 What happens if you drop the foreign keys from the DataFrames and try to merge them?

In [26]:
(users.merge(roles, 
            left_on='role_id', 
            right_on='id', 
            how='outer')
    .drop(columns='role_id')
    .rename(columns={'id_x': 'id', 
                     'name_x': 'employee',
                     'id_y': 'role_id',
                     'name_y': 'role'}
            )
)

    id employee  role_id       role
0  1.0      bob      1.0      admin
1  2.0      joe      2.0     author
2  3.0    sally      3.0   reviewer
3  4.0     adam      3.0   reviewer
4  5.0     jane      NaN        NaN
5  6.0     mike      NaN        NaN
6  NaN      NaN      4.0  commenter

#### #5 Load the mpg dataset from PyDataset.

In [27]:
from pydataset import data

In [28]:
mpg_df = data('mpg')

#### #6 Output and read the documentation for the mpg dataset.

In [29]:
mpg_df

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact
...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize

#### #7 How many rows and columns are in the dataset?

In [30]:
mpg_df.shape
#234 columns
#11 rows

(234, 11)

#### #8 Check out your column names and perform any cleanup you may want on them.

In [31]:
mpg_clean = mpg_df.rename(columns ={'cty':'city', 'hwy':'highway'})
#replaced cty with city, and hwy with highway

mpg_df.columns = map(str.title, mpg_clean.columns)
# this capitalizes first letter of column titles

mpg_clean

,manufacturer,model,displ,year,cyl,trans,drv,city,highway,fl,class
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact
...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize

#### #9 Display the summary statistics for the dataset.

In [32]:
mpg_df.describe()

            Displ         Year         Cyl        City     Highway
count  234.000000   234.000000  234.000000  234.000000  234.000000
mean     3.471795  2003.500000    5.888889   16.858974   23.440171
std      1.291959     4.509646    1.611534    4.255946    5.954643
min      1.600000  1999.000000    4.000000    9.000000   12.000000
25%      2.400000  1999.000000    4.000000   14.000000   18.000000
50%      3.300000  2003.500000    6.000000   17.000000   24.000000
75%      4.600000  2008.000000    8.000000   19.000000   27.000000
max      7.000000  2008.000000    8.000000   35.000000   44.000000

#### #10 How many different manufacturers are there?

In [33]:
#My proccess:
#first, I asked myself how to retrieve JUST the manufacturers
mpg_df['Manufacturer']
#this is called "bracket notation"

1            audi
2            audi
3            audi
4            audi
5            audi
          ...
230    volkswagen
231    volkswagen
232    volkswagen
233    volkswagen
234    volkswagen
Name: Manufacturer, Length: 234, dtype: object

In [34]:
#then, I found out what the unique manufacturers were
mpg_df['Manufacturer'].unique()

array(['audi', 'chevrolet', 'dodge', 'ford', 'honda', 'hyundai', 'jeep',
       'land rover', 'lincoln', 'mercury', 'nissan', 'pontiac', 'subaru',
       'toyota', 'volkswagen'], dtype=object)

In [35]:
#then, I wrapped that in a 'len' to get the count of unique manufacturers
len(mpg_df['Manufacturer'].unique())

15

#### #11 How many different models are there?

In [36]:
len(mpg_df['Model'].unique())

38

#### #12 Create a column named mileage_difference like you did in the DataFrames exercises; this column should contain the difference between highway and city mileage for each car.

In [37]:
mpg_df['mileage_difference'] = mpg_df['Highway']- mpg_df['City']
mpg_df

,Manufacturer,Model,Displ,Year,Cyl,Trans,Drv,City,Highway,Fl,Class,mileage_difference
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10
...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9

#### #13 Create a column named average_mileage like you did in the DataFrames exercises; this is the mean of the city and highway mileage.

In [38]:
mpg_df['average_mileage'] = (mpg_df['Highway'] + mpg_df['City']) / 2
mpg_df

,Manufacturer,Model,Displ,Year,Cyl,Trans,Drv,City,Highway,Fl,Class,mileage_difference,average_mileage
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9,23.5
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8,25.0
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10,21.0
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8,22.0
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9,21.5

#### #14 Create a new column on the mpg dataset named is_automatic that holds boolean values denoting whether the car has an automatic transmission.

In [39]:
mpg_df['is_automatic'] = mpg_df['Trans'].str.contains('auto')                     
mpg_df

,Manufacturer,Model,Displ,Year,Cyl,Trans,Drv,City,Highway,Fl,Class,mileage_difference,average_mileage,is_automatic
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5,True
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0,False
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5,False
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5,True
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9,23.5,True
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8,25.0,False
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10,21.0,True
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8,22.0,False
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9,21.5,True

#### #15 Using the mpg dataset, find out which manufacturer has the best miles per gallon on average?

In [40]:
mpg_df.sort_values(['average_mileage'], ascending =(False)).head(1)

,Manufacturer,Model,Displ,Year,Cyl,Trans,Drv,City,Highway,Fl,Class,mileage_difference,average_mileage,is_automatic
222,volkswagen,new beetle,1.9,1999,4,manual(m5),f,35,44,d,subcompact,9,39.5,False

#### #16 Do automatic or manual cars have better miles per gallon?

In [41]:
mpg_df.sort_values(['average_mileage'], ascending =(False)).head(10)
# 6 out of top 10 are NOT automatic
# Manual have best mileage

,Manufacturer,Model,Displ,Year,Cyl,Trans,Drv,City,Highway,Fl,Class,mileage_difference,average_mileage,is_automatic
222,volkswagen,new beetle,1.9,1999,4,manual(m5),f,35,44,d,subcompact,9,39.5,False
213,volkswagen,jetta,1.9,1999,4,manual(m5),f,33,44,d,compact,11,38.5,False
223,volkswagen,new beetle,1.9,1999,4,auto(l4),f,29,41,d,subcompact,12,35.0,True
197,toyota,corolla,1.8,2008,4,manual(m5),f,28,37,r,compact,9,32.5,False
196,toyota,corolla,1.8,1999,4,manual(m5),f,26,35,r,compact,9,30.5,False
106,honda,civic,1.8,2008,4,auto(l5),f,25,36,r,subcompact,11,30.5,True
100,honda,civic,1.6,1999,4,manual(m5),f,28,33,r,subcompact,5,30.5,False
198,toyota,corolla,1.8,2008,4,auto(l4),f,26,35,r,compact,9,30.5,True
105,honda,civic,1.8,2008,4,manual(m5),f,26,34,r,subcompact,8,30.0,False
107,honda,civic,1.8,2008,4,auto(l5),f,24,36,c,subcompact,12,30.0,True

In [55]:
is_auto=(mpg_df["is_automatic"] == True).sum()
is_auto
#average_mileage of auto
#average_mileage of man

157

In [57]:
mpg_df['Trans'].mean(str.contains('auto'))

AttributeError: type object 'str' has no attribute 'contains'